{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/auto-response.yml","desc":"GitHub Actions workflow that automates issue/PR management by triggering on label events. Defines response rules (r: skill, r: support, r: third-party-extension, r: moltbook) that automatically post standardized comments, close issues, and lock threads. Auto-detects Moltbook mentions in issues and applies appropriate labels."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/labeler.yml","desc":"GitHub Actions labeler configuration that automatically tags pull requests with channel-specific labels (discord, telegram, whatsapp, etc.), component labels (gateway, cli, agents), and platform labels (android, ios, web-ui) based on file path patterns in changed files."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/dependabot.yml","desc":"Configures GitHub Dependabot to automatically check for dependency updates across OpenClaw's multi-platform codebase. Monitors npm packages (root), Swift packages (macOS app, MoltbotKit, Swabble), Gradle dependencies (Android), and GitHub Actions with weekly schedules, grouping updates by type and limiting open PRs."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/labeler.yml","desc":"GitHub Actions workflow that automatically labels pull requests and issues. Uses the actions/labeler for PR file-based labeling via .github/labeler.yml config, and applies \"maintainer\" labels to contributions from org members/owners. Part of OpenClaw's CI/CD automation infrastructure."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/ISSUE_TEMPLATE/feature_request.md","desc":"GitHub issue template for feature requests in OpenClaw. Provides a standardized structure for users to propose new ideas and improvements, including sections for problem summary, proposed solution, alternatives considered, and additional context. Automatically applies the enhancement label."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/FUNDING.yml","desc":"GitHub funding configuration that enables sponsorship for the OpenClaw project. Points to the project maintainer's (steipete) GitHub Sponsors profile, allowing users to financially support development through the repository's Sponsor button."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.gitattributes","desc":"Git attributes configuration that enforces consistent line endings across all text files. Sets auto-detection of text files and normalizes all line endings to LF (Unix-style), ensuring cross-platform compatibility for the OpenClaw codebase regardless of contributor operating systems."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.gitignore","desc":"Standard Git ignore file that excludes build artifacts, dependencies, and environment files from version control. Covers Node.js (node_modules), TypeScript (dist), iOS/macOS builds (.build, .xcodeproj), test outputs, and sensitive data (.env). Essential for keeping the repository clean."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pre-commit-config.yaml","desc":"Configures pre-commit hooks for code quality, security, and formatting validation. Runs automated checks including secret detection, linting (oxlint, shellcheck, swiftlint), formatting (oxfmt, swiftformat), and GitHub Actions validation before commits. Mirrors CI pipeline checks locally to catch issues early in development."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/MainViewModel.kt","desc":"Android MVVM ViewModel that exposes NodeRuntime state and operations to UI layer. Provides StateFlow properties for connection status, gateway discovery, chat, camera, location, voice wake, and canvas management. Delegates all business logic to NodeRuntime while serving as UI-friendly facade."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/ISSUE_TEMPLATE/bug_report.md","desc":"GitHub issue template for bug reports in OpenClaw. Provides structured format for users to report problems with standardized sections: summary, reproduction steps, expected/actual behavior, environment details, and logs. Helps maintainers efficiently triage and debug issues."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/workflow-sanity.yml","desc":"GitHub Actions workflow that enforces code quality standards for CI/CD pipeline files. Runs on every push and PR to scan all workflow YAML files in .github/workflows/, failing the build if any contain tab characters. Ensures consistent indentation across the automation infrastructure."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/ci.yml","desc":"GitHub Actions CI workflow that runs comprehensive automated tests on push/PR. Orchestrates 6 jobs: install-check, checks (Node/Bun matrix for lint/test/tsgo/format/protocol), secrets scanning, checks-windows, checks-macos, macos-app (Swift lint/build/test), and android (Gradle test/build). Validates OpenClaw across platforms."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/PermissionRequester.kt","desc":"Android permission management utility that handles runtime permission requests (camera, microphone, SMS) for OpenClaw. Implements coroutine-based permission flow with rationale/settings dialogs, mutex-based request serialization, and timeout handling. Used by MainActivity and other Android components requiring system permissions."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.oxlintrc.json","desc":"Configuration file for oxlint (a fast TypeScript/JavaScript linter) that enforces code quality rules across OpenClaw. Enables correctness, performance, and suspicious code detection as errors, with specific rules for TypeScript type safety and coding patterns. Excludes build artifacts, vendor code, and third-party directories from linting."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/prompts/landpr.md","desc":"AI assistant prompt template for the /landpr workflow command that performs thorough PR review before merging. Defines a structured 9-step review process covering validation, implementation quality, tests, and generating actionable recommendations. Works with reviewpr.md as part of OpenClaw's development workflow automation."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/.gitignore","desc":"Standard Android Gradle project gitignore that excludes build artifacts, IDE configuration files, and local properties from version control. Prevents committing Gradle cache, build directories, IDEA project files, and environment-specific settings for the Android client app."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/docker-release.yml","desc":"GitHub Actions workflow that automates Docker image releases for OpenClaw. Builds multi-architecture images (amd64/arm64) in parallel, pushes them to GitHub Container Registry, and creates a unified multi-platform manifest. Triggers on main branch pushes and version tags for CI/CD deployment."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/NodeRuntime.kt","desc":"Core Android runtime orchestrating dual-role gateway connections (operator & node), device capabilities (camera, location, screen, SMS, canvas, voice wake), and chat/talk-mode interactions. Manages state flows, permissions, A2UI canvas integration, and RPC invoke handlers for AI assistant commands in OpenClaw's Android client."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/ISSUE_TEMPLATE/config.yml","desc":"GitHub issue template configuration that enables blank issues and defines custom contact links redirecting users to OpenClaw's Discord server for onboarding and support. Directs new users and help seekers to the #help channel where Krill provides community assistance, streamlining support away from GitHub issues."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/appcast.xml","desc":"Sparkle framework appcast feed for macOS auto-updates. Defines release metadata (version numbers, download URLs, Ed25519 signatures, changelogs) that the OpenClaw desktop app checks to notify users of new versions and enable secure automatic updates."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/NodeForegroundService.kt","desc":"Android foreground service that maintains persistent OpenClaw node connectivity. Monitors NodeRuntime state (connection status, voice wake mode, microphone usage) and displays persistent notifications. Manages foreground service types (DATA_SYNC, MICROPHONE) based on voice features and handles user disconnect actions."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/chat/ChatSheetContent.kt","desc":"Main chat UI orchestrator composable that binds MainViewModel state to ChatMessageListCard and ChatComposer components. Manages image attachment selection via Android ContentResolver, converting URIs to base64-encoded OutgoingAttachments. Coordinates session loading, message rendering, and user input flow for the Android chat interface."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/SettingsSheet.kt","desc":"Jetpack Compose UI component for Android app settings management. Provides comprehensive configuration interface for node identity, gateway discovery/connection, voice wake, camera/SMS/location permissions, and manual gateway settings. Binds to MainViewModel state flows and manages Android permission launchers."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.dockerignore","desc":"Defines files and directories excluded from Docker image builds for OpenClaw. Excludes development artifacts (node_modules, .turbo, coverage), VCS data (.git), media files, build outputs (dist, .next), and large unused app trees (apps/, assets/). Optimizes Docker image size for CLI deployment."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/actionlint.yaml","desc":"Configuration file for actionlint, a GitHub Actions workflow linter integrated via pre-commit hooks. Defines self-hosted Blacksmith CI runners (Ubuntu/Windows) and suppresses known false positives like shellcheck warnings and intentional disabled jobs."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.npmrc","desc":"Configures pnpm security policy by whitelisting packages allowed to run build scripts during installation. Permits native modules (baileys for WhatsApp, sharp for images, esbuild, node-pty, Matrix crypto) to compile while blocking untrusted packages from executing arbitrary code."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.swiftformat","desc":"SwiftFormat configuration file that defines code formatting rules for Swift 6 components in OpenClaw. Enforces consistent styling (4-space indent, 120-char line width, explicit self) across Swift codebases like Swabble, excluding build artifacts and cross-platform app directories."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.shellcheckrc","desc":"ShellCheck linter configuration for the project's shell scripts (docker-setup.sh, deployment scripts, etc). Disables specific warnings like SC2034 (unused variables), SC2155 (declare/assign), and SC2016 (single quote expansion) that are false positives or intentional patterns in OpenClaw's build/deployment automation."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/MainActivity.kt","desc":"Primary Android activity that bootstraps the OpenClaw mobile client. Initializes NodeRuntime via MainViewModel, starts the NodeForegroundService for persistent gateway connections, and manages device capabilities (camera, SMS, screen recording) and permissions. Renders RootScreen UI using Jetpack Compose and handles lifecycle events."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/chat/ChatController.kt","desc":"Manages Android chat UI state and orchestrates communication with OpenClaw gateway via GatewaySession. Handles message sending/receiving, real-time streaming, tool call tracking, session management, and event processing (chat/agent streams). Maintains StateFlows for messages, health, sessions, and streaming state."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/GatewayDiscovery.kt","desc":"Implements automatic gateway discovery for the Android client using both mDNS/Bonjour (local network) and DNS-SD (wide-area). Queries for _openclaw-gw._tcp service records, resolves endpoints with connection details (host, port, TLS config), and exposes discovered gateways via StateFlow for the UI connection selector."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/AGENTS.md","desc":"Comprehensive development guidelines for contributors and AI agents working on OpenClaw. Defines project structure, coding standards, testing workflows, commit conventions, PR review processes, release procedures, and platform-specific development tips. Serves as the canonical reference for maintaining code quality, ensuring consistency across multi-channel architecture, and coordinating multi-agent development work."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/prompts/is.md","desc":"Prompt template for analyzing GitHub issues in OpenClaw. Instructs the AI to read issues fully with comments/links, identify root causes for bugs by tracing code paths, and propose concise implementations for feature requests. Part of .pi workflow automation system."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/node/CameraCaptureManager.kt","desc":"Manages camera capture operations for the Android client, providing snap() for still photos and clip() for video recording. Handles CameraX lifecycle binding, permission requests, image processing (rotation, scaling, compression to 5MB API limit), and Base64 encoding. Part of native capability layer alongside other managers (SMS, location, screen)."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/node/LocationCaptureManager.kt","desc":"Manages GPS/network location capture for the Android node, providing the AI with real-time or cached device location data. Handles permission checks, provider selection (GPS/network), and returns JSON payloads with coordinates, accuracy, altitude, speed, and heading. Part of the node capability layer that exposes Android sensors to OpenClaw."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/git/.gitignore","desc":"Git ignore configuration for OpenClaw's .pi directory (pi-coding-agent customization). Uses whitelist strategy (*,\!.gitignore) to track directory structure while preventing runtime cache/metadata commits. Part of pi-agent integration that provides custom extensions and AI workflows."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/GatewayEndpoint.kt","desc":"Data class representing a gateway server endpoint configuration in OpenClaw's Android app. Stores connection parameters (host, port, LAN/Tailnet addresses) and TLS settings for the Android client to connect to OpenClaw gateway instances. Used by GatewayDiscovery for mDNS discovery and GatewaySession for WebSocket connections."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/LocationMode.kt","desc":"Defines location permission states for OpenClaw Android app (Off, WhileUsing, Always). Used by MainViewModel and SecurePrefs to manage location tracking settings, allowing AI assistants to access location data based on user preferences stored in encrypted preferences."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/node/CanvasController.kt","desc":"Manages WebView rendering for OpenClaw Android node. Handles canvas commands from gateway (navigate, eval, snapshot) to display UI and capture screenshots as base64. Integrates with NodeRuntime as one of six device capabilities enabling remote agents to control Android UI."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/protocol/OpenClawCanvasA2UIAction.kt","desc":"Protocol utility for Canvas A2UI (Agent-to-UI) actions in Android. Formats user canvas interactions into agent messages (CANVAS_A2UI action=X session=Y...), sanitizes tag values, and generates JavaScript status callbacks. Bridges WebView events to OpenClaw gateway protocol."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-anydpi/ic_launcher.xml","desc":"Android adaptive icon configuration for OpenClaw app launcher. Defines the app icon with separate background, foreground, and monochrome layers for compatibility across different Android device themes and launcher styles."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-anydpi/ic_launcher_round.xml","desc":"Android adaptive icon configuration for the round launcher icon. Defines the visual appearance of OpenClaw's app icon on Android devices, specifying background color, foreground drawable, and monochrome variant for themed icons across different launchers."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/protocol/OpenClawProtocolConstants.kt","desc":"Defines protocol constants for the OpenClaw Android app including device capabilities (canvas, camera, screen, SMS, location) and command enums for each capability. Serves as the contract between AI assistants and Android native features, enabling AI-driven device control through standardized command namespaces."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/chat/ChatModels.kt","desc":"Defines core Kotlin data classes for Android chat functionality: ChatMessage with multi-part content (text/attachments), ChatPendingToolCall for tool execution tracking, ChatSessionEntry for multi-session support, ChatHistory for conversation context, and OutgoingAttachment for user media. Serves as the domain model contract between gateway WebSocket JSON parsing, ChatController state management, and Compose UI rendering."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/prompts/cl.md","desc":"Defines the /cl slash command workflow for auditing changelog entries before releases. Validates that all commits since the last release tag have corresponding entries in package CHANGELOGs, enforces format and attribution standards, handles cross-package duplication for monorepo structure."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.secrets.baseline","desc":"Baseline configuration for detect-secrets scanner that prevents accidental commits of API keys, tokens, and credentials. Contains plugin definitions for AWS, Azure, Discord, GitHub tokens and entropy-based detectors, plus a whitelist of known false positives across OpenClaw's codebase to enable automated security scanning in CI/CD."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/chat/ChatMessageViews.kt","desc":"Jetpack Compose UI components for rendering chat messages in the Android app. Provides message bubbles (user/assistant), streaming indicators, tool execution displays, and markdown/image rendering. Bridges ChatMessage/ChatMessageContent models to visual UI with Material Design 3 theming."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/chat/ChatMessageListCard.kt","desc":"Composable UI component that renders the scrollable chat message list in OpenClaw's Android app. Displays ChatMessage items, typing indicators, pending tool calls, and streaming assistant responses using LazyColumn. Auto-scrolls to latest messages and shows an empty state hint when no conversation exists."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/GatewayProtocol.kt","desc":"Defines the gateway protocol version constant (version 3) for the Android client. This version is sent during WebSocket handshake to negotiate compatibility with the OpenClaw server, ensuring protocol alignment across clients (Android, web, CLI) before message exchange begins."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/RootScreen.kt","desc":"Main Android UI screen composable that orchestrates the OpenClaw client interface. Embeds a WebView canvas for AI visual interactions, renders overlay controls (chat, settings, talk mode buttons), displays connection status pills, and manages sheets for chat/settings. Bridges WebView JavaScript to native Android via CanvasA2UIActionBridge."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/DeviceAuthStore.kt","desc":"Manages secure storage and retrieval of role-based device authentication tokens in the Android gateway. Wraps SecurePrefs to cache tokens per device-role combination, enabling persistent authentication for both operator (UI control) and node (device capabilities) gateway sessions without re-entering credentials."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/AndroidManifest.xml","desc":"Android app configuration manifest defining permissions (camera, SMS, location, microphone), services (NodeForegroundService for persistent gateway connection), and MainActivity launcher. Configures the OpenClaw Android node capabilities and declares required hardware features for the multi-channel AI gateway companion app."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/extensions/prompt-url-widget.ts","desc":"Pi-coding-agent extension that detects GitHub PR/issue URLs in prompts and displays enhanced metadata. Hooks into before_agent_start, session_switch, and session_start events to render a UI widget showing title, author, and URL fetched via gh CLI, while auto-updating session names."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/node/SmsManager.kt","desc":"Sends SMS messages via Androids native SMS API as a node capability in OpenClaws RPC system. Parses JSON params with phone/message, handles permissions, supports multipart messages, and returns structured results. Integrates with NodeRuntime for gateway-invoked commands."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/OpenClawTheme.kt","desc":"Defines the Jetpack Compose theming system for OpenClaw Android app. Provides OpenClawTheme composable that applies Material3 dynamic color schemes based on system dark/light mode. Includes helper functions for overlay container and icon colors used throughout the UI components like RootScreen, SettingsSheet, and ChatSheet."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.swiftlint.yml","desc":"SwiftLint configuration for OpenClaw's macOS Swift app (apps/macos/Sources). Enforces code quality with Swift 6-friendly rules including unused declaration detection, opt-in style rules, and relaxed limits. Excludes auto-generated files and delegates formatting to SwiftFormat. Integrated into CI/CD and pre-commit hooks."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.agent/workflows/update_clawdbot.md","desc":"Agent workflow documenting upstream sync procedures for OpenClaw forks. Guides rebase/merge strategies, conflict resolution, dependency rebuilds, and macOS app packaging. Includes Swift 6.2 migration fixes and agent verification steps for maintaining fork divergence."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/xml/network_security_config.xml","desc":"Android network security configuration that permits cleartext HTTP traffic for the OpenClaw Android app. Enables unencrypted communication with Tailscale VPN (ts.net) and local development endpoints (openclaw.local), supporting the app's use case of running on trusted private networks where HTTPS is not required."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/NodeApp.kt","desc":"Android Application entry point that initializes NodeRuntime - the core orchestration layer managing gateway connections, chat, camera, location, canvas, and voice wake features. Enables StrictMode for debug builds to detect threading/VM violations. Acts as the top-level container providing access to OpenClaw's multi-platform gateway runtime."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/GatewaySession.kt","desc":"Manages WebSocket connections to OpenClaw gateway servers. Handles RPC-based communication, authentication via device identity and tokens, session state persistence, event routing, and bidirectional command invocation. Integrates with DeviceIdentityStore/DeviceAuthStore for crypto and GatewayTls for secure connections."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/gateway/GatewayTls.kt","desc":"Provides TLS/SSL security configuration for Android gateway connections. Implements certificate pinning with SHA-256 fingerprint validation and TOFU (Trust On First Use) support. Creates custom X509TrustManager that validates server certificates against expected fingerprints or falls back to default system trust, used by GatewaySession for secure WebSocket connections."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/voice/TalkDirectiveParser.kt","desc":"Parses JSON voice directives embedded in AI responses to configure text-to-speech parameters. Extracts TTS settings like voiceId, speed, stability, and model parameters from the first line of assistant messages, stripping them before playback. Used by TalkModeManager for Android voice mode."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-hdpi/ic_launcher_foreground.png","desc":"HDPI density launcher icon foreground layer for OpenClaw Android app. Part of adaptive icon system, displays the ClawBot mascot graphic at 162x162dp for high-density screens. Works with background layer to create the app launcher icon."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/test/java/ai/openclaw/android/gateway/BonjourEscapesTest.kt","desc":"Unit tests for BonjourEscapes decoder that handles mDNS/Bonjour service name encoding. Tests decimal escape sequence parsing (\032 for spaces, UTF-8 multi-byte chars) used in network service discovery for gateway connection on Android."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/extensions/diff.ts","desc":"Pi Coding Agent extension that registers a /diff command for developer tooling. Shows git working tree changes in an interactive TUI selector, opening files in VS Code diff view. Part of AI developer experience enhancements, not OpenClaw gateway functionality."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/test/java/ai/openclaw/android/node/CanvasControllerSnapshotParamsTest.kt","desc":"Unit tests for CanvasController snapshot parameter parsing. Validates JSON parsing for image format (PNG/JPEG with aliases), quality clamping (0.1-1.0), and maxWidth settings. Ensures WebView canvas capture parameters are correctly interpreted for AI assistant visual responses."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-hdpi/ic_launcher.png","desc":"HDPI (high-density) launcher icon for OpenClaw Android app. Part of Android resource system providing app icon at 72x72dp resolution for ~240dpi screens. Works with Android adaptive icon framework alongside other density variants (mdpi, xhdpi, etc.) to ensure proper display across devices."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/node/ScreenRecordManager.kt","desc":"Manages screen recording capability for the Android node in OpenClaw. Captures device screen video with audio using MediaRecorder/MediaProjection APIs, handles permissions, and returns MP4 files as Base64-encoded JSON payloads. Enables AI agents on the Gateway to remotely record Android device screens via the nodes tool."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/test/java/ai/openclaw/android/node/SmsManagerTest.kt","desc":"Unit tests for the SmsManager class that validates SMS sending functionality in OpenClaw's Android app. Tests parameter parsing, JSON validation, phone number/message requirements, multipart message handling, and payload escaping to ensure reliable SMS channel operations."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-mdpi/ic_launcher_foreground.png","desc":"Medium-density (mdpi) foreground layer of the Android app launcher icon, displaying the OpenClaw branding with a robot/claw design. Part of Android adaptive icon system where foreground and background layers combine to create the final launcher icon across different device launchers and shapes."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/voice/StreamingMediaDataSource.kt","desc":"Implements Android MediaDataSource to stream audio chunks from ElevenLabs TTS API to MediaPlayer for progressive MP3 playback. Buffers incoming audio data with thread-safe append/finish/fail methods and serves it to MediaPlayer via readAt(). Used by TalkModeManager as fallback audio playback path."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/test/java/ai/openclaw/android/protocol/OpenClawCanvasA2UIActionTest.kt","desc":"Unit tests for OpenClawCanvasA2UIAction protocol utilities in the Android app. Tests action name extraction from JSON (name/action fields), agent message formatting with sanitized tags for Canvas A2UI protocol, and JavaScript dispatch code generation for action status events sent to WebView components."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/test/java/ai/openclaw/android/voice/TalkDirectiveParserTest.kt","desc":"Unit tests for TalkDirectiveParser, which parses JSON voice synthesis directives from AI assistant responses. Tests directive parsing (voice ID, model, speech parameters), unknown key handling, alternate key formats, and text stripping functionality for OpenClaw's Android voice output feature."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/DeviceNames.kt","desc":"Utility that generates user-friendly device names for Android nodes. Provides bestDefaultNodeName() which tries Android system device_name, falls back to manufacturer+model, or defaults to \"Android Node\". Called during NodeRuntime initialization via SecurePrefs to set the node's display name for gateway connections and UI."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/gradle.properties","desc":"Gradle build configuration for OpenClaw's Android mobile app. Defines JVM memory settings (3GB heap), enables AndroidX support, and optimizes resource compilation with non-transitive R classes for faster builds."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/CameraHudState.kt","desc":"Defines UI state model for camera operations in OpenClaw Android app. Contains CameraHudKind enum (Photo, Recording, Success, Error) and CameraHudState data class with token, kind, and message fields. Managed by NodeRuntime StateFlow and rendered via StatusPill to show camera capture feedback to users."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xhdpi/ic_launcher_foreground.png","desc":"xhdpi-density foreground layer for OpenClaw Android app launcher icon, showing the claw mascot logo. Part of Android adaptive icon system, displayed at 192x192dp on extra-high-density screens (~320dpi). Works with background layer to create launcher icon."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xhdpi/ic_launcher.png","desc":"Android launcher icon (xhdpi density, 96x96dp) for OpenClaw mobile app. Displayed on device home screens and app drawers. Referenced in AndroidManifest.xml as @mipmap/ic_launcher. Part of multi-density icon set for adaptive display across Android devices."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.pi/prompts/reviewpr.md","desc":"AI agent skill template for comprehensive PR review workflow. Provides step-by-step instructions for the embedded pi-coding-agent to analyze GitHub PRs using gh CLI, evaluate code quality/tests/security, and output structured recommendations (READY/NEEDS WORK) without merging."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xxhdpi/ic_launcher.png","desc":"Android app launcher icon at xxhdpi density (144x144dp). Part of OpenClaw's Android client resource set, providing the app's home screen icon across different device densities. Located in the standard Android mipmap directory structure for adaptive icon rendering."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/voice/TalkModeManager.kt","desc":"Full-duplex voice conversation system for Android that orchestrates speech-to-text input, gateway API communication, and ElevenLabs text-to-speech output. Manages lifecycle states (listening/speaking/thinking), handles silence detection for transcript finalization, supports interrupt-on-speech, and falls back to system TTS when needed."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.github/workflows/formal-conformance.yml","desc":"GitHub Actions workflow that validates conformance between OpenClaw's TypeScript implementation and its formal TLA+ security models. Extracts tool groups from codebase, runs 90+ model checks covering authorization, session isolation, gateway exposure, and message deduplication, then detects drift in generated artifacts and posts informational PR comments."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xxhdpi/ic_launcher_foreground.png","desc":"Android adaptive icon foreground layer at xxhdpi density (144x144dp, 216x216px). Features OpenClaw's crab mascot with 'CLAWDBOT' branding in a storefront scene. Part of the adaptive icon system that works with ic_launcher_background to create the app icon across Android devices."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/gradlew.bat","desc":"Gradle Wrapper batch script for Windows that enables building the OpenClaw Android app without requiring a pre-installed Gradle distribution. Locates Java, sets JVM options, and executes Gradle commands via the wrapper JAR in apps/android/gradle/wrapper/."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xxxhdpi/ic_launcher_foreground.png","desc":"XXXHDPI density (640dpi) foreground layer for OpenClaw Android app launcher icon. Shows the ClawdBot mascot at a phone booth storefront. Part of Android adaptive icon system, layered with background to create the app icon on high-resolution devices."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/.oxfmtrc.jsonc","desc":"Configuration file for oxfmt, a fast TypeScript/JavaScript code formatter. Defines import sorting rules, package.json sorting, and ignore patterns for directories like apps/, dist/, and node_modules/. Integrated into pre-commit hooks and CI/CD pipelines to enforce consistent code style across the multi-platform OpenClaw project."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/build.gradle.kts","desc":"Gradle build configuration for OpenClaw Android app module. Defines SDK versions (min 31, target 36), Jetpack Compose UI setup, and dependencies for core subsystems: WebSocket gateway client, CameraX media capture, WebView canvas rendering, DNS-SD discovery, and encrypted storage. Integrates shared OpenClawKit resources from Swift codebase."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/SecurePrefs.kt","desc":"Encrypted settings storage for the Android node using EncryptedSharedPreferences (AES256-GCM). Manages device identity, gateway credentials (tokens/passwords/TLS fingerprints), connection settings (manual host/port), and capability flags (camera/location/voice wake). Exposes reactive StateFlow properties for Compose UI."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/mipmap-xxxhdpi/ic_launcher.png","desc":"xxxhdpi-density launcher icon for OpenClaw Android app. Displays a 192x192px branded crab mascot (ClawBot) against a phone booth backdrop. Part of Android adaptive icon system providing high-res app icon for devices with ~640dpi screens."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/gradle/wrapper/gradle-wrapper.properties","desc":"Gradle wrapper configuration for OpenClaw's Android node app. Specifies Gradle 9.2.1 distribution URL and caching paths, enabling consistent build tool versioning across development environments. Essential for building the Android app that connects to the Gateway WebSocket."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/README.md","desc":"Documentation for OpenClaw's Android node app, which connects to the Gateway WebSocket via mDNS discovery and exposes Canvas, Chat, and Camera capabilities. Uses a foreground service to maintain persistent connection, shares the 'main' session key across platforms, and requires Android 12+ (API 31) with Kotlin and Jetpack Compose."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/ios/fastlane/SETUP.md","desc":"Setup guide for fastlane automation in OpenClaw iOS app deployment. Documents App Store Connect API key configuration, code signing setup, and environment variables needed to automate beta TestFlight builds via fastlane, streamlining the iOS release process."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/ios/.swiftlint.yml","desc":"iOS-specific SwiftLint configuration that inherits from the root .swiftlint.yml. Specifies which directories to include for linting (Sources and shared ClawdisNodeKit), enabling Swift code quality enforcement for the iOS client that connects users to OpenClaw gateway."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/ChatSheet.kt","desc":"Lightweight Compose wrapper that delegates to ChatSheetContent for the Android chat UI. Rendered in a ModalBottomSheet from RootScreen, it passes MainViewModel to enable message display, composition, session management, and real-time updates via WebSocket-connected backend StateFlows."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/res/values/colors.xml","desc":"Android color resource file defining the dark background color (#0A0A0A) for the OpenClaw app launcher icon. Part of the Android app resources structure, referenced by AndroidManifest.xml for the app icon appearance."}
{"file":"/Users/saymanmini/Documents/GitHub/openclaw/apps/android/app/src/main/java/ai/openclaw/android/ui/chat/ChatComposer.kt","desc":"Android Compose UI component for the chat input area. Provides text input field, session/thinking level dropdown selectors, image attachment handling, send/abort buttons, and connection status display. Integrates with MainViewModel state management and used by ChatSheetContent as the main message composition interface."}
